jzrls/21C852-0/slave/src/F2812_eCAN.c
#include "F28335_Device.h"
#include "App_UserDef.h"

#include "core\command.h"

#pragma CODE_SECTION(ECana_T, "ramfuncs");
#pragma CODE_SECTION(Can_Tx_Data, "ramfuncs");
#pragma CODE_SECTION(Can_Tx2_Data, "ramfuncs");
#pragma CODE_SECTION(Can_Tx4_Data, "ramfuncs");
#pragma CODE_SECTION(Can_Tx11_Data, "ramfuncs");
#pragma CODE_SECTION(Can_Tx13_Data, "ramfuncs");
#pragma CODE_SECTION(Can_Rt_Data, "ramfuncs");

void Can_Rt_Data(Uint16 Num) {
    volatile _iq tmp = 0;
    static _iq sumSpeed = 0;
    static Uint16 index = 0;
    _iq speed = 0;

    static _iq speedArray[16] = {0};

    if (Num == 1) {
        Uint16 isPump = BORAD_NUM == 2 || BORAD_NUM == 3;
        if (isPump) {
            // 将转速标幺值转换为IQ15的实际转速值，再转换为16位整数,低字节在前
            tmp = _IQmpy(Velo_Elec_abs, _IQ(9.5492965855137201461330258023509));
            tmp = _IQdiv(tmp, Mp);
            tmp = _IQmpy(tmp, V_Base >> 5);
            tmp = (tmp >> 15);
            if (tmp >= 65535) {
                tmp = 65535;
            }

            /**
             * 对tmp进行16次均值滤波处理
             */
            // sumSpeed += tmp;
            // index++;
            // if (index >= 16) {
            //     speed = sumSpeed >> 4;
            //     sumSpeed = 0;
            //     index = 0;
            // }

            if (index < 16) {
                speedArray[index] = tmp;
                index++;

                for (int i = 0; i < index - 1; i++) {
                    sumSpeed += speedArray[i];
                }
                speed = sumSpeed / index;

            } else {
                for (int i = 0; i < 15; i++) {
                    speedArray[i] = speedArray[i + 1];
                }
                speedArray[15] = tmp;
                for (int i = 0; i < index - 1; i++) {
                    sumSpeed += speedArray[i];
                }
                speed = sumSpeed / index;
            }

            CAN_BUFFER_RT[BORAD_NUM][0] = speed & 0x00FF;
            CAN_BUFFER_RT[BORAD_NUM][1] = (speed >> 8) & 0x00FF;

            Fault_Flag.bit.POS_LIMIT = 0;
        } else {
            /**
             * 蝶阀位置
             *
             * 将16位的位置转换为角度值，再*100转换为16位整数,低字节在前
             *
             * 360°对应65535：360 / 65535
             * 实际角度与计算角度有100的定标系数
             */
            tmp = Angle_Fa_Q16;
            tmp = _IQmpy(tmp, _IQ(0.54931640625)); // 360/65536*100
            if (tmp >= 65535) {
                tmp = 65535;
            }
            CAN_BUFFER_RT[BORAD_NUM][0] = tmp & 0x00FF;
            CAN_BUFFER_RT[BORAD_NUM][1] = (tmp >> 8) & 0x00FF;

            /**
             * 软件限位
             *
             * 大于65000或者小于500
             */
            if ((Angle_Fa_Q16 > POSMAX) || (Angle_Fa_Q16 < POSMIN)) {
                Fault_Flag.bit.POS_LIMIT = 1;
            } else {
                Fault_Flag.bit.POS_LIMIT = 0;
            }
        }

        /**
         * 故障位
         */
        Fault_Flag.bit.STOP_VELO_FLAG = Ctrl_Flag.bit.STOP_VELO_FLAG;
        Fault_Flag.bit.STOP_PWM_Flag = Ctrl_Flag.bit.STOP_PWM_Flag;

        /* 母线过流故障 */
        Fault_Flag.bit.STOP_PWM_Flag_Id = Sys_Flag.bit.STOP_PWM_Flag_Id;

        /* 超速故障 */
        Fault_Flag.bit.STOP_PWM_Flag_Velo = Sys_Flag.bit.STOP_PWM_Flag_Velo;

        /* 硬件保护 */
        Fault_Flag.bit.STOP_PWM_Flag_Driv = Sys_Flag.bit.STOP_PWM_Flag_Driv;

        Fault_Flag.bit.UDC_FLAG = Sys_Flag.bit.UDC_FLAG; /* 母线过压故障 */
        Fault_Flag.bit.Temp1Over_Flag = Ctrl_Flag.bit.Temp1Over_Flag;
        Fault_Flag.bit.Temp2Over_Flag = Ctrl_Flag.bit.Temp2Over_Flag;

        Fault_Flag.bit.UdcLow_Flag = Ctrl_Flag.bit.UdcLow_Flag; /* 欠压故障 */
        Fault_Flag.bit.CANERROR_FLAG = Ctrl_Flag.bit.CANERROR_FLAG;
        Fault_Flag.bit.RunAllow_Flag = RunAllow_Flag;
        CAN_BUFFER_RT[BORAD_NUM][2] = (Fault_Flag.all & 0x00FF);
        CAN_BUFFER_RT[BORAD_NUM][3] = ((Fault_Flag.all) >> 8) & 0x00FF;

        /**
         * 控制器温度
         *
         * 温度值转换为IQ15的实际值，再将其转换为单精度浮点数对应的十六进制表示
         */
        if (Temperature5 <= _IQ(0)) {
            tmp = 0;
        } else {
            tmp = _IQmpy(Temperature5, 100);
        }

        if (tmp >= 65535) {
            tmp = 65535;
        }
        CAN_BUFFER_RT[BORAD_NUM][4] = tmp & 0x00FF;
        CAN_BUFFER_RT[BORAD_NUM][5] = (tmp >> 8) & 0x00FF;

        // 将母线电压标幺值转换为IQ15的实际值，再将其转换为单精度浮点数对应的十六进制表示
        if (Udc_Mche_1 <= _IQ(0)) {
            tmp = 0;
        } else {
            tmp = _IQdiv(Udc_Mche_1, U_Base);
            tmp = _IQmpy(tmp, 100);
        }

        if (tmp >= 65535) {
            tmp = 65535;
        }
        CAN_BUFFER_RT[BORAD_NUM][6] = tmp & 0x00FF;
        CAN_BUFFER_RT[BORAD_NUM][7] = (tmp >> 8) & 0x00FF;

        CAN_BUFFER_RT[BORAD_NUM][8] = 0;
    }

    if (Num == 2) {
        // 将母线电流标幺值转换为IQ15的实际值，再将其转换为单精度浮点数对应的十六进制表示
        tmp = _IQdiv(_IQabs(Idc), I_Base);
        tmp = _IQmpy(tmp, 100);
        if (tmp >= 65535) {
            tmp = 65535;
        }
        CAN_BUFFER_RT[BORAD_NUM][9] = tmp & 0x00FF;
        CAN_BUFFER_RT[BORAD_NUM][10] = (tmp >> 8) & 0x00FF;

        // 将A相电流标幺值转换为IQ15的实际值，再将其转换为单精度浮点数对应的十六进制表示
        tmp = _IQdiv(_IQabs(Isa), I_Base);
        tmp = _IQmpy(tmp, 100);
        if (tmp >= 65535) {
            tmp = 65535;
        }
        CAN_BUFFER_RT[BORAD_NUM][11] = tmp & 0x00FF;
        CAN_BUFFER_RT[BORAD_NUM][12] = (tmp >> 8) & 0x00FF;

        // 将B相电流标幺值转换为IQ15的实际值，再将其转换为单精度浮点数对应的十六进制表示
        tmp = _IQdiv(_IQabs(Isb), I_Base);
        tmp = _IQmpy(tmp, 100);
        if (tmp >= 65535) {
            tmp = 65535;
        }
        CAN_BUFFER_RT[BORAD_NUM][13] = tmp & 0x00FF;
        CAN_BUFFER_RT[BORAD_NUM][14] = (tmp >> 8) & 0x00FF;

        // 将C相电流标幺值转换为IQ15的实际值，再将其转换为单精度浮点数对应的十六进制表示
        tmp = _IQdiv(_IQabs(Isc), I_Base);
        tmp = _IQmpy(tmp, 100);
        if (tmp >= 65535) {
            tmp = 65535;
        }
        CAN_BUFFER_RT[BORAD_NUM][15] = tmp & 0x00FF;
        CAN_BUFFER_RT[BORAD_NUM][16] = (tmp >> 8) & 0x00FF;
    }
}

void Can_Ctrl(Uint16 Board) {
    volatile _iq tmp = 0;

    if (Board == 0) {
        if ((CAN_BUFFER_RX[2] == 0x11 && CAN_BUFFER_RX[3] == 0x5A) || Ctrl_Flag.bit.STOP_PWM_Flag == 1 ||
            (Ctrl_Flag.bit.FIRST_PWM_Flag == 1 && Velo_Elec_abs > Velo_Start)) {
            Ctrl_Flag.bit.STOP_VELO_FLAG = 1;
            Ctrl_Flag.bit.CAN_Ctrl = 0;
        } else if (CAN_BUFFER_RX[2] == 0x10 && CAN_BUFFER_RX[3] == 0xA5) {
            Ctrl_Flag.bit.CAN_Ctrl = 1;
        } else if (CAN_BUFFER_RX[2] == 0x12) {
            Isd_Set = 0;
            tmp = Hex_Float(CAN_BUFFER_RX[3], CAN_BUFFER_RX[4], CAN_BUFFER_RX[5], CAN_BUFFER_RX[6]);
            tmp = _IQmpy(tmp,
                         _IQ(0.0055555555555555555555555555555556)); // 65536/360>>15
            Pos_Set = tmp;
            if (Pos_Set > POSMAX) {
                Pos_Set = POSMAX;
            }
            if (Pos_Set < POSMIN) {
                Pos_Set = POSMIN;
            }

            TorqueAngleA = 0;
            if (RunAllow_Flag == 1) {
                Ctrl_Flag.bit.VELO_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.POS_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.STOP_VELO_FLAG = 0;
                Ctrl_Flag.bit.TORQ_CONTROL_FLAG = 1;
            }
        }
    }

    if (Board == 1) {
        if ((CAN_BUFFER_CTRL[2] == 0x11 && CAN_BUFFER_CTRL[3] == 0x5A) || Ctrl_Flag.bit.STOP_PWM_Flag == 1 ||
            (Ctrl_Flag.bit.FIRST_PWM_Flag == 1 && Velo_Elec_abs > Velo_Start)) {
            Ctrl_Flag.bit.STOP_VELO_FLAG = 1;
            Ctrl_Flag.bit.CAN_Ctrl = 0;
        } else if (CAN_BUFFER_CTRL[2] == 0x10 && CAN_BUFFER_CTRL[3] == 0xA5) {
            Ctrl_Flag.bit.CAN_Ctrl = 1;
        } else if (CAN_BUFFER_CTRL[2] == 0x12) {
            Isd_Set = 0;
            tmp = Hex_Float(CAN_BUFFER_CTRL[3], CAN_BUFFER_CTRL[4], CAN_BUFFER_CTRL[5], CAN_BUFFER_CTRL[6]);

