jzrls/21C852-0/slave/src/F2812_eCAN.c
            // 65536/360>>15
            tmp = _IQmpy(tmp, _IQ(0.0055555555555555555555555555555556));
            Pos_Set = tmp;
            if (Pos_Set > POSMAX) {
                Pos_Set = POSMAX;
            }
            if (Pos_Set < POSMIN) {
                Pos_Set = POSMIN;
            }

            TorqueAngleA = 0;
            if (RunAllow_Flag == 1) {
                Ctrl_Flag.bit.VELO_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.POS_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.STOP_VELO_FLAG = 0;
                Ctrl_Flag.bit.TORQ_CONTROL_FLAG = 1;
            }
        }
    }

    /* 油泵电机主CPU执行控制功能 */
    if (Board == 2) {
        Uint16 isStopPump = CAN_BUFFER_RX[2] == 0x11 && CAN_BUFFER_RX[3] == 0xA5;
        Uint16 isStopPwm = Ctrl_Flag.bit.STOP_PWM_Flag == 1;
        Uint16 isFristPwm = Ctrl_Flag.bit.FIRST_PWM_Flag == 1;
        Uint16 isCurrentSpeedOverStartSpeed = Velo_Elec_abs > Velo_Start;
        if (isStopPump || isStopPwm || (isFristPwm && isCurrentSpeedOverStartSpeed)) {
            Ctrl_Flag.bit.STOP_VELO_FLAG = 1;
            Ctrl_Flag.bit.CAN_Ctrl = 0;
        } else if (CAN_BUFFER_RX[2] == 0x10 && CAN_BUFFER_RX[3] == 0x55) {
            /* 启动电机 */
            Ctrl_Flag.bit.CAN_Ctrl = 1;
        } else if (CAN_BUFFER_RX[2] == 0x14) {
            /* 设置电机转速 */
            Isd_Set = 0;
            TorqueAngleA = 0;
            _iq speed = Hex_Float(CAN_BUFFER_RX[3], CAN_BUFFER_RX[4], CAN_BUFFER_RX[5], CAN_BUFFER_RX[6]);
            Veloover_Set = _IQdiv(speed, _IQmpy((V_Base >> 5), _IQdiv(_IQ(9.5492965855137201461330258023509), Mp)));
            if (Veloover_Set > maxSpeed) {
                Veloover_Set = maxSpeed;
            }

            /* 运行方向 */
            if (Ctrl_Flag.bit.VelWay_Flag == 1) {
                Veloover_Set = -Veloover_Set;
            }

            /* 允许运行标志 */
            if (RunAllow_Flag == 1) {
                Ctrl_Flag.bit.VELO_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.POS_CONTROL_FLAG = 0;
                Ctrl_Flag.bit.STOP_VELO_FLAG = 0;
                Ctrl_Flag.bit.TORQ_CONTROL_FLAG = 1;
            }
        }
    }

    if (Board == 3) {
        if ((CAN_BUFFER_CTRL[2] == 0x11 && CAN_BUFFER_CTRL[3] == 0xA5) || Ctrl_Flag.bit.STOP_PWM_Flag == 1 ||
            (Ctrl_Flag.bit.FIRST_PWM_Flag == 1 && Velo_Elec_abs > Velo_Start)) {
            Ctrl_Flag.bit.STOP_VELO_FLAG = 1;
            Ctrl_Flag.bit.CAN_Ctrl = 0;
        } else if (CAN_BUFFER_CTRL[2] == 0x10 && CAN_BUFFER_CTRL[3] == 0x55) {
            Ctrl_Flag.bit.CAN_Ctrl = 1;
        } else if (CAN_BUFFER_CTRL[2] == 0x14) {
            Isd_Set = 0;
            TorqueAngleA = 0;
            tmp = Hex_Float(CAN_BUFFER_CTRL[3], CAN_BUFFER_CTRL[4], CAN_BUFFER_CTRL[5], CAN_BUFFER_CTRL[6]);
            Veloover_Set = _IQdiv(tmp, _IQmpy((V_Base >> 5), _IQdiv(_IQ(9.5492965855137201461330258023509), Mp)));
            if (Veloover_Set > maxSpeed) {
                Veloover_Set = maxSpeed;
            }

            if (Ctrl_Flag.bit.VelWay_Flag == 1) {
                Veloover_Set = -Veloover_Set;
            }

            if (RunAllow_Flag == 1) {
                Ctrl_Flag.bit.VELO_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.POS_CONTROL_FLAG = 0;
                Ctrl_Flag.bit.STOP_VELO_FLAG = 0;
                Ctrl_Flag.bit.TORQ_CONTROL_FLAG = 1;
            }
        }
    }

    if (Board == 4) {
        if ((CAN_BUFFER_RX[2] == 0x11 && CAN_BUFFER_RX[3] == 0x55) || Ctrl_Flag.bit.STOP_PWM_Flag == 1 ||
            (Ctrl_Flag.bit.FIRST_PWM_Flag == 1 && Velo_Elec_abs > Velo_Start)) {
            Ctrl_Flag.bit.STOP_VELO_FLAG = 1;
            Ctrl_Flag.bit.CAN_Ctrl = 0;
        } else if (CAN_BUFFER_RX[2] == 0x10 && CAN_BUFFER_RX[3] == 0xAA) {
            Ctrl_Flag.bit.CAN_Ctrl = 1;
        } else if (CAN_BUFFER_RX[2] == 0x13) {
            Isd_Set = 0;
            tmp = Hex_Float(CAN_BUFFER_RX[3], CAN_BUFFER_RX[4], CAN_BUFFER_RX[5], CAN_BUFFER_RX[6]);

            // 65536/360>>15
            tmp = _IQmpy(tmp, _IQ(0.0055555555555555555555555555555556));
            Pos_Set = tmp;
            if (Pos_Set > POSMAX)
                Pos_Set = POSMAX;
            if (Pos_Set < POSMIN)
                Pos_Set = POSMIN;

            TorqueAngleA = 0;
            if (RunAllow_Flag == 1) {
                Ctrl_Flag.bit.VELO_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.POS_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.STOP_VELO_FLAG = 0;
                Ctrl_Flag.bit.TORQ_CONTROL_FLAG = 1;
            }
        }
    }

    if (Board == 5) {
        if ((CAN_BUFFER_CTRL[2] == 0x11 && CAN_BUFFER_CTRL[3] == 0x55) || Ctrl_Flag.bit.STOP_PWM_Flag == 1 ||
            (Ctrl_Flag.bit.FIRST_PWM_Flag == 1 && Velo_Elec_abs > Velo_Start)) {
            Ctrl_Flag.bit.STOP_VELO_FLAG = 1;
            Ctrl_Flag.bit.CAN_Ctrl = 0;
        } else if (CAN_BUFFER_CTRL[2] == 0x10 && CAN_BUFFER_CTRL[3] == 0xAA) {
            Ctrl_Flag.bit.CAN_Ctrl = 1;
        } else if (CAN_BUFFER_CTRL[2] == 0x13) {
            Isd_Set = 0;
            tmp = Hex_Float(CAN_BUFFER_CTRL[3], CAN_BUFFER_CTRL[4], CAN_BUFFER_CTRL[5], CAN_BUFFER_CTRL[6]);

            // 65536/360>>15
            tmp = _IQmpy(tmp, _IQ(0.0055555555555555555555555555555556));
            Pos_Set = tmp;
            if (Pos_Set > POSMAX) {
                Pos_Set = POSMAX;
            }

            if (Pos_Set < POSMIN) {
                Pos_Set = POSMIN;
            }

            TorqueAngleA = 0;
            if (RunAllow_Flag == 1) {
                Ctrl_Flag.bit.VELO_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.POS_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.STOP_VELO_FLAG = 0;
                Ctrl_Flag.bit.TORQ_CONTROL_FLAG = 1;
            }
        }
    }
}
/*--------------------------------------------------------------------------
 --------------------------------------------------------------------------------
 can发送程序
 -------------------------------------------------------------------------------*/
void Can_Tx_Data() {
    DELAY_US(1000);
    if (ECanaRegs.CANTA.bit.TA1 == 1) {
        ECanaShadow.CANTA.all = ECanaRegs.CANTA.all;
        ECanaShadow.CANTA.bit.TA1 = 1;
        ECanaRegs.CANTA.all = ECanaShadow.CANTA.all;
    }
    ECanaRegs.CANMC.bit.CDR = 1;

