jzrls/21C852-0/slave/src/F2812_eCAN.c
    if (CANB.FLAG.bit.TXBO_FLAG == 0) {
        if (CANB.m_Tx_Length > 0) {
            if (CANB.m_Tx_Length > 0) {
                ECanaMboxes.MBOX1.MDL.byte.BYTE4 = *CANB.p_Tx_Buffer++;
                CANB.m_Tx_Length--;
            }

            if (CANB.m_Tx_Length > 0) {
                ECanaMboxes.MBOX1.MDL.byte.BYTE3 = *CANB.p_Tx_Buffer++;
                CANB.m_Tx_Length--;
            }

            if (CANB.m_Tx_Length > 0) {
                ECanaMboxes.MBOX1.MDL.byte.BYTE2 = *CANB.p_Tx_Buffer++;
                CANB.m_Tx_Length--;
            }

            if (CANB.m_Tx_Length > 0) {
                ECanaMboxes.MBOX1.MDL.byte.BYTE1 = *CANB.p_Tx_Buffer++;
                CANB.m_Tx_Length--;
            }

            if (CANB.m_Tx_Length > 0) {
                ECanaMboxes.MBOX1.MDH.byte.BYTE8 = *CANB.p_Tx_Buffer++;
                CANB.m_Tx_Length--;
            }

            if (CANB.m_Tx_Length > 0) {
                ECanaMboxes.MBOX1.MDH.byte.BYTE7 = *CANB.p_Tx_Buffer++;
                CANB.m_Tx_Length--;
            }

            if (CANB.m_Tx_Length > 0) {
                ECanaMboxes.MBOX1.MDH.byte.BYTE6 = *CANB.p_Tx_Buffer++;
                CANB.m_Tx_Length--;
            }

            if (CANB.m_Tx_Length > 0) {
                ECanaMboxes.MBOX1.MDH.byte.BYTE5 = *CANB.p_Tx_Buffer++;
                CANB.m_Tx_Length--;
            }

            ECanaMboxes.MBOX1.MSGCTRL.bit.DLC = 8;
            ECanaRegs.CANMC.bit.CDR = 0;
            ECanaShadow.CANTRS.all = ECanaRegs.CANTRS.all;
            ECanaShadow.CANTRS.all = 0;
            ECanaShadow.CANTRS.bit.TRS1 = 1;
            ECanaRegs.CANTRS.all = ECanaShadow.CANTRS.all;
        } else {
            CANB.FLAG.bit.TXBO_FLAG = 1;
            CANB.p_Tx_Buffer = TX_BUFFER;
        }
    }
}
void Can_Tx2_Data() {
    DELAY_US(1000);
    if (ECanaRegs.CANTA.bit.TA2 == 1) {
        ECanaShadow.CANTA.all = ECanaRegs.CANTA.all;
        ECanaShadow.CANTA.bit.TA2 = 1;
        ECanaRegs.CANTA.all = ECanaShadow.CANTA.all;
    }
    ECanaRegs.CANMC.bit.CDR = 1;

    if (CANB2.FLAG.bit.TXBO_FLAG == 0) {
        if (CANB2.m_Tx_Length > 0) {
            if (CANB2.m_Tx_Length > 0) {
                ECanaMboxes.MBOX2.MDL.byte.BYTE4 = *CANB2.p_Tx_Buffer++;
                CANB2.m_Tx_Length--;
            }

            if (CANB2.m_Tx_Length > 0) {
                ECanaMboxes.MBOX2.MDL.byte.BYTE3 = *CANB2.p_Tx_Buffer++;
                CANB2.m_Tx_Length--;
            }

            if (CANB2.m_Tx_Length > 0) {
                ECanaMboxes.MBOX2.MDL.byte.BYTE2 = *CANB2.p_Tx_Buffer++;
                CANB2.m_Tx_Length--;
            }

            if (CANB2.m_Tx_Length > 0) {
                ECanaMboxes.MBOX2.MDL.byte.BYTE1 = *CANB2.p_Tx_Buffer++;
                CANB2.m_Tx_Length--;
            }

            if (CANB2.m_Tx_Length > 0) {
                ECanaMboxes.MBOX2.MDH.byte.BYTE8 = *CANB2.p_Tx_Buffer++;
                CANB2.m_Tx_Length--;
            }

            if (CANB2.m_Tx_Length > 0) {
                ECanaMboxes.MBOX2.MDH.byte.BYTE7 = *CANB2.p_Tx_Buffer++;
                CANB2.m_Tx_Length--;
            }

            if (CANB2.m_Tx_Length > 0) {
                ECanaMboxes.MBOX2.MDH.byte.BYTE6 = *CANB2.p_Tx_Buffer++;
                CANB2.m_Tx_Length--;
            }

            if (CANB2.m_Tx_Length > 0) {
                ECanaMboxes.MBOX2.MDH.byte.BYTE5 = *CANB2.p_Tx_Buffer++;
                CANB2.m_Tx_Length--;
            }

            ECanaMboxes.MBOX2.MSGCTRL.bit.DLC = 8;
            ECanaRegs.CANMC.bit.CDR = 0;
            ECanaShadow.CANTRS.all = ECanaRegs.CANTRS.all;
            ECanaShadow.CANTRS.all = 0;
            ECanaShadow.CANTRS.bit.TRS2 = 1;
            ECanaRegs.CANTRS.all = ECanaShadow.CANTRS.all;
        } else {
            CANB2.FLAG.bit.TXBO_FLAG = 1;
            CANB2.p_Tx_Buffer = SCI_RX_BUFFER;
        }
    }
}

void Can_Tx4_Data() {
    if (ECanaRegs.CANTA.bit.TA4 == 1) {
        ECanaShadow.CANTA.all = ECanaRegs.CANTA.all;
        ECanaShadow.CANTA.bit.TA4 = 1;
        ECanaRegs.CANTA.all = ECanaShadow.CANTA.all;
    }
    ECanaRegs.CANMC.bit.CDR = 1;

    Can_Rt_Data(1);
    ECanaMboxes.MBOX4.MDL.byte.BYTE4 = CAN_BUFFER_RT[BORAD_NUM][0];
    ECanaMboxes.MBOX4.MDL.byte.BYTE3 = CAN_BUFFER_RT[BORAD_NUM][1];
    ECanaMboxes.MBOX4.MDL.byte.BYTE2 = CAN_BUFFER_RT[BORAD_NUM][2];
    ECanaMboxes.MBOX4.MDL.byte.BYTE1 = CAN_BUFFER_RT[BORAD_NUM][3];
    ECanaMboxes.MBOX4.MDH.byte.BYTE8 = CAN_BUFFER_RT[BORAD_NUM][4];
    ECanaMboxes.MBOX4.MDH.byte.BYTE7 = CAN_BUFFER_RT[BORAD_NUM][5];
    ECanaMboxes.MBOX4.MDH.byte.BYTE6 = CAN_BUFFER_RT[BORAD_NUM][6];
    ECanaMboxes.MBOX4.MDH.byte.BYTE5 = CAN_BUFFER_RT[BORAD_NUM][7];

    ECanaMboxes.MBOX4.MSGCTRL.bit.DLC = 8;
    ECanaRegs.CANMC.bit.CDR = 0;
    ECanaShadow.CANTRS.all = ECanaRegs.CANTRS.all;
    ECanaShadow.CANTRS.all = 0;
    ECanaShadow.CANTRS.bit.TRS4 = 1;
    ECanaRegs.CANTRS.all = ECanaShadow.CANTRS.all;
}

void Can_Tx13_Data() {
    if (ECanaRegs.CANTA.bit.TA13 == 1) {
        ECanaShadow.CANTA.all = ECanaRegs.CANTA.all;
        ECanaShadow.CANTA.bit.TA13 = 1;
        ECanaRegs.CANTA.all = ECanaShadow.CANTA.all;
    }
    ECanaRegs.CANMC.bit.CDR = 1;

    Can_Rt_Data(2);
    ECanaMboxes.MBOX13.MDL.byte.BYTE4 = CAN_BUFFER_RT[BORAD_NUM][9];
    ECanaMboxes.MBOX13.MDL.byte.BYTE3 = CAN_BUFFER_RT[BORAD_NUM][10];
    ECanaMboxes.MBOX13.MDL.byte.BYTE2 = CAN_BUFFER_RT[BORAD_NUM][11];
    ECanaMboxes.MBOX13.MDL.byte.BYTE1 = CAN_BUFFER_RT[BORAD_NUM][12];
    ECanaMboxes.MBOX13.MDH.byte.BYTE8 = CAN_BUFFER_RT[BORAD_NUM][13];
    ECanaMboxes.MBOX13.MDH.byte.BYTE7 = CAN_BUFFER_RT[BORAD_NUM][14];
    ECanaMboxes.MBOX13.MDH.byte.BYTE6 = CAN_BUFFER_RT[BORAD_NUM][15];
    ECanaMboxes.MBOX13.MDH.byte.BYTE5 = CAN_BUFFER_RT[BORAD_NUM][16];

    ECanaMboxes.MBOX13.MSGCTRL.bit.DLC = 8;
    ECanaRegs.CANMC.bit.CDR = 0;
    ECanaShadow.CANTRS.all = ECanaRegs.CANTRS.all;
    ECanaShadow.CANTRS.all = 0;
    ECanaShadow.CANTRS.bit.TRS13 = 1;
    ECanaRegs.CANTRS.all = ECanaShadow.CANTRS.all;
}

void Can_Tx11_Data() {
    if (ECanaRegs.CANTA.bit.TA11 == 1) {
        ECanaShadow.CANTA.all = ECanaRegs.CANTA.all;
        ECanaShadow.CANTA.bit.TA11 = 1;
        ECanaRegs.CANTA.all = ECanaShadow.CANTA.all;
    }
    ECanaRegs.CANMC.bit.CDR = 1;

    Can_Rt_Data(1);
    Can_Rt_Data(2);

    ECanaMboxes.MBOX11.MDL.byte.BYTE4 = CAN_BUFFER_RX[0];
    ECanaMboxes.MBOX11.MDL.byte.BYTE3 = CAN_BUFFER_RX[1];
    ECanaMboxes.MBOX11.MDL.byte.BYTE2 = CAN_BUFFER_RX[2];
    ECanaMboxes.MBOX11.MDL.byte.BYTE1 = CAN_BUFFER_RX[3];
    ECanaMboxes.MBOX11.MDH.byte.BYTE8 = CAN_BUFFER_RX[4];
    ECanaMboxes.MBOX11.MDH.byte.BYTE7 = CAN_BUFFER_RX[5];
    ECanaMboxes.MBOX11.MDH.byte.BYTE6 = CAN_BUFFER_RX[6];
    ECanaMboxes.MBOX11.MDH.byte.BYTE5 = CAN_BUFFER_RX[7];

