jzrls/21C852-0/slave/src/F2812_eCAN.c
    ECanaMboxes.MBOX11.MSGCTRL.bit.DLC = 8;
    ECanaRegs.CANMC.bit.CDR = 0;
    ECanaShadow.CANTRS.all = ECanaRegs.CANTRS.all;
    ECanaShadow.CANTRS.all = 0;
    ECanaShadow.CANTRS.bit.TRS11 = 1;
    ECanaRegs.CANTRS.all = ECanaShadow.CANTRS.all;
}

interrupt void ECana_T(void) {
    volatile Uint16 i;
    volatile Uint16 Sum_Temp = 0;
    if (ECanaRegs.CANRMP.bit.RMP0 == 1) /*等待所有RMP0置位*/
    {
        if (CANB.FLAG.bit.RX_FLAG == 0) // && CANB.FLAG.bit.TXBO_FLAG == 1)
        {
            *CANB.p_Rx_Buffer = ECanaMboxes.MBOX0.MDL.byte.BYTE4;
            CANB.p_Rx_Buffer++;
            *CANB.p_Rx_Buffer = ECanaMboxes.MBOX0.MDL.byte.BYTE3;
            CANB.p_Rx_Buffer++;
            *CANB.p_Rx_Buffer = ECanaMboxes.MBOX0.MDL.byte.BYTE2;
            CANB.p_Rx_Buffer++;
            *CANB.p_Rx_Buffer = ECanaMboxes.MBOX0.MDL.byte.BYTE1;
            CANB.p_Rx_Buffer++;
            *CANB.p_Rx_Buffer = ECanaMboxes.MBOX0.MDH.byte.BYTE8;
            CANB.p_Rx_Buffer++;
            *CANB.p_Rx_Buffer = ECanaMboxes.MBOX0.MDH.byte.BYTE7;
            CANB.p_Rx_Buffer++;
            *CANB.p_Rx_Buffer = ECanaMboxes.MBOX0.MDH.byte.BYTE6;
            CANB.p_Rx_Buffer++;
            *CANB.p_Rx_Buffer = ECanaMboxes.MBOX0.MDH.byte.BYTE5;
            CANB.p_Rx_Buffer++;

            if (CANB.p_Rx_Buffer >= (Uint16 *)(RX_BUFFER + RX_BUFFER_LENGTH)) {
                CANB.p_Rx_Buffer = RX_BUFFER;
                CANB.m_Rx_Length = 0;
            }
            // 检查包头是否为AA55,以及获取数据长度----------------------
            else if (RX_BUFFER[0] == 0x00EB && RX_BUFFER[1] == 0x0090 &&
                     RX_BUFFER[4] <= (Uint16)(RX_BUFFER_LENGTH - 7)) {
                CANB.m_Rx_Length = RX_BUFFER[4];
                if (CANB.p_Rx_Buffer >= (Uint16 *)(RX_BUFFER + CANB.m_Rx_Length + 7)) {
                    Sum_Temp = CalCRC16_Byte(RX_BUFFER, CANB.m_Rx_Length + 0x0005);

                    if (Sum_Temp == RX_BUFFER[CANB.m_Rx_Length + 5] + (RX_BUFFER[CANB.m_Rx_Length + 6] << 8)) {
                        CANB.FLAG.bit.RX_FLAG = 1;
                        CANB.p_Rx_Buffer = RX_BUFFER;
                        CANB.m_Rx_Length = 0;
                    } else {
                        CANB.p_Rx_Buffer = RX_BUFFER;
                        CANB.m_Rx_Length = 0;
                    }
                }
            } else {
                CANB.p_Rx_Buffer = RX_BUFFER;
                CANB.m_Rx_Length = 0;
            }
        }

        ECanaRegs.CANRMP.bit.RMP0 = 1; /*清除所有RMP0位并开始接收消息*/
    }
    if (ECanaRegs.CANRMP.bit.RMP3 == 1) /*等待所有RMP0置位*/
    {
        if (CANB2.FLAG.bit.RX_FLAG == 0) // && CANB2.FLAG.bit.TXBO_FLAG == 1)
        {
            *CANB2.p_Rx_Buffer = ECanaMboxes.MBOX3.MDL.byte.BYTE4;
            CANB2.p_Rx_Buffer++;
            *CANB2.p_Rx_Buffer = ECanaMboxes.MBOX3.MDL.byte.BYTE3;
            CANB2.p_Rx_Buffer++;
            *CANB2.p_Rx_Buffer = ECanaMboxes.MBOX3.MDL.byte.BYTE2;
            CANB2.p_Rx_Buffer++;
            *CANB2.p_Rx_Buffer = ECanaMboxes.MBOX3.MDL.byte.BYTE1;
            CANB2.p_Rx_Buffer++;
            *CANB2.p_Rx_Buffer = ECanaMboxes.MBOX3.MDH.byte.BYTE8;
            CANB2.p_Rx_Buffer++;
            *CANB2.p_Rx_Buffer = ECanaMboxes.MBOX3.MDH.byte.BYTE7;
            CANB2.p_Rx_Buffer++;
            *CANB2.p_Rx_Buffer = ECanaMboxes.MBOX3.MDH.byte.BYTE6;
            CANB2.p_Rx_Buffer++;
            *CANB2.p_Rx_Buffer = ECanaMboxes.MBOX3.MDH.byte.BYTE5;
            CANB2.p_Rx_Buffer++;

            if (CANB2.p_Rx_Buffer >= (Uint16 *)(SCI_TX_BUFFER + RX_BUFFER_LENGTH)) {
                CANB2.p_Rx_Buffer = SCI_TX_BUFFER;
                CANB2.m_Rx_Length = 0;
            }
            // 检查包头是否为AA55,以及获取数据长度----------------------
            else if (SCI_TX_BUFFER[0] == 0x00EB && SCI_TX_BUFFER[1] == 0x0090 &&
                     SCI_TX_BUFFER[4] <= (Uint16)(RX_BUFFER_LENGTH - 7)) {
                CANB2.m_Rx_Length = SCI_TX_BUFFER[4];
                if (CANB2.p_Rx_Buffer >= (Uint16 *)(SCI_TX_BUFFER + CANB2.m_Rx_Length + 7)) {
                    Sum_Temp = CalCRC16_Byte(SCI_TX_BUFFER, CANB2.m_Rx_Length + 0x0005);

                    if (Sum_Temp ==
                        SCI_TX_BUFFER[CANB2.m_Rx_Length + 5] + (SCI_TX_BUFFER[CANB2.m_Rx_Length + 6] << 8)) {
                        CANB2.FLAG.bit.RX_FLAG = 1;
                        CANB2.p_Rx_Buffer = SCI_TX_BUFFER;
                        CANB2.m_Rx_Length = 0;
                    } else {
                        CANB2.p_Rx_Buffer = SCI_TX_BUFFER;
                        CANB2.m_Rx_Length = 0;
                    }
                }
            } else {
                CANB2.p_Rx_Buffer = SCI_TX_BUFFER;
                CANB2.m_Rx_Length = 0;
            }
        }

        ECanaRegs.CANRMP.bit.RMP3 = 1; /*清除所有RMP0位并开始接收消息*/
    }

    /*等待所有RMP5置位*/
    if (ECanaRegs.CANRMP.bit.RMP5 == 1) {
        if (BORAD_NUM != 0) {
            CAN_BUFFER_RT[0][0] = ECanaMboxes.MBOX5.MDL.byte.BYTE4;
            CAN_BUFFER_RT[0][1] = ECanaMboxes.MBOX5.MDL.byte.BYTE3;
            CAN_BUFFER_RT[0][2] = ECanaMboxes.MBOX5.MDL.byte.BYTE2;
            CAN_BUFFER_RT[0][3] = ECanaMboxes.MBOX5.MDL.byte.BYTE1;
            CAN_BUFFER_RT[0][4] = ECanaMboxes.MBOX5.MDH.byte.BYTE8;
            CAN_BUFFER_RT[0][5] = ECanaMboxes.MBOX5.MDH.byte.BYTE7;
            CAN_BUFFER_RT[0][6] = ECanaMboxes.MBOX5.MDH.byte.BYTE6;
            CAN_BUFFER_RT[0][7] = ECanaMboxes.MBOX5.MDH.byte.BYTE5;
            CAN_BUFFER_RT[0][8] = 0;
        }
        ECanaRegs.CANRMP.bit.RMP5 = 1; /*清除所有RMP5位并开始接收消息*/
    }

    /*等待所有RMP6置位*/
    if (ECanaRegs.CANRMP.bit.RMP6 == 1) {
        if (BORAD_NUM != 1) {
            CAN_BUFFER_RT[1][0] = ECanaMboxes.MBOX6.MDL.byte.BYTE4;
            CAN_BUFFER_RT[1][1] = ECanaMboxes.MBOX6.MDL.byte.BYTE3;
            CAN_BUFFER_RT[1][2] = ECanaMboxes.MBOX6.MDL.byte.BYTE2;
            CAN_BUFFER_RT[1][3] = ECanaMboxes.MBOX6.MDL.byte.BYTE1;
            CAN_BUFFER_RT[1][4] = ECanaMboxes.MBOX6.MDH.byte.BYTE8;
            CAN_BUFFER_RT[1][5] = ECanaMboxes.MBOX6.MDH.byte.BYTE7;
            CAN_BUFFER_RT[1][6] = ECanaMboxes.MBOX6.MDH.byte.BYTE6;
            CAN_BUFFER_RT[1][7] = ECanaMboxes.MBOX6.MDH.byte.BYTE5;
            CAN_BUFFER_RT[1][8] = 0;
        }
        ECanaRegs.CANRMP.bit.RMP6 = 1; /*清除所有RMP6位并开始接收消息*/
    }

