jzrls/21C852-0/slave/src/F2812_eCAN.c
    /*等待所有RMP7置位*/
    if (ECanaRegs.CANRMP.bit.RMP7 == 1) {
        if (BORAD_NUM != 2) {
            CAN_BUFFER_RT[2][0] = ECanaMboxes.MBOX7.MDL.byte.BYTE4;
            CAN_BUFFER_RT[2][1] = ECanaMboxes.MBOX7.MDL.byte.BYTE3;
            CAN_BUFFER_RT[2][2] = ECanaMboxes.MBOX7.MDL.byte.BYTE2;
            CAN_BUFFER_RT[2][3] = ECanaMboxes.MBOX7.MDL.byte.BYTE1;
            CAN_BUFFER_RT[2][4] = ECanaMboxes.MBOX7.MDH.byte.BYTE8;
            CAN_BUFFER_RT[2][5] = ECanaMboxes.MBOX7.MDH.byte.BYTE7;
            CAN_BUFFER_RT[2][6] = ECanaMboxes.MBOX7.MDH.byte.BYTE6;
            CAN_BUFFER_RT[2][7] = ECanaMboxes.MBOX7.MDH.byte.BYTE5;
            CAN_BUFFER_RT[2][8] = 0;
        }
        ECanaRegs.CANRMP.bit.RMP7 = 1; /*清除所有RMP7位并开始接收消息*/
    }

    /*等待所有RMP8置位*/
    if (ECanaRegs.CANRMP.bit.RMP8 == 1) {
        if (BORAD_NUM != 3) {
            CAN_BUFFER_RT[3][0] = ECanaMboxes.MBOX8.MDL.byte.BYTE4;
            CAN_BUFFER_RT[3][1] = ECanaMboxes.MBOX8.MDL.byte.BYTE3;
            CAN_BUFFER_RT[3][2] = ECanaMboxes.MBOX8.MDL.byte.BYTE2;
            CAN_BUFFER_RT[3][3] = ECanaMboxes.MBOX8.MDL.byte.BYTE1;
            CAN_BUFFER_RT[3][4] = ECanaMboxes.MBOX8.MDH.byte.BYTE8;
            CAN_BUFFER_RT[3][5] = ECanaMboxes.MBOX8.MDH.byte.BYTE7;
            CAN_BUFFER_RT[3][6] = ECanaMboxes.MBOX8.MDH.byte.BYTE6;
            CAN_BUFFER_RT[3][7] = ECanaMboxes.MBOX8.MDH.byte.BYTE5;
            CAN_BUFFER_RT[3][8] = 0;
        }
        ECanaRegs.CANRMP.bit.RMP8 = 1; /*清除所有RMP8位并开始接收消息*/
    }

    /*等待所有RMP9置位*/
    if (ECanaRegs.CANRMP.bit.RMP9 == 1) {
        if (BORAD_NUM != 4) {
            CAN_BUFFER_RT[4][0] = ECanaMboxes.MBOX9.MDL.byte.BYTE4;
            CAN_BUFFER_RT[4][1] = ECanaMboxes.MBOX9.MDL.byte.BYTE3;
            CAN_BUFFER_RT[4][2] = ECanaMboxes.MBOX9.MDL.byte.BYTE2;
            CAN_BUFFER_RT[4][3] = ECanaMboxes.MBOX9.MDL.byte.BYTE1;
            CAN_BUFFER_RT[4][4] = ECanaMboxes.MBOX9.MDH.byte.BYTE8;
            CAN_BUFFER_RT[4][5] = ECanaMboxes.MBOX9.MDH.byte.BYTE7;
            CAN_BUFFER_RT[4][6] = ECanaMboxes.MBOX9.MDH.byte.BYTE6;
            CAN_BUFFER_RT[4][7] = ECanaMboxes.MBOX9.MDH.byte.BYTE5;
            CAN_BUFFER_RT[4][8] = 0;
        }
        ECanaRegs.CANRMP.bit.RMP9 = 1; /*清除所有RMP9位并开始接收消息*/
    }

    if (ECanaRegs.CANRMP.bit.RMP10 == 1) /*等待所有RMP10置位*/
    {
        if (BORAD_NUM != 5) {
            CAN_BUFFER_RT[5][0] = ECanaMboxes.MBOX10.MDL.byte.BYTE4;
            CAN_BUFFER_RT[5][1] = ECanaMboxes.MBOX10.MDL.byte.BYTE3;
            CAN_BUFFER_RT[5][2] = ECanaMboxes.MBOX10.MDL.byte.BYTE2;
            CAN_BUFFER_RT[5][3] = ECanaMboxes.MBOX10.MDL.byte.BYTE1;
            CAN_BUFFER_RT[5][4] = ECanaMboxes.MBOX10.MDH.byte.BYTE8;
            CAN_BUFFER_RT[5][5] = ECanaMboxes.MBOX10.MDH.byte.BYTE7;
            CAN_BUFFER_RT[5][6] = ECanaMboxes.MBOX10.MDH.byte.BYTE6;
            CAN_BUFFER_RT[5][7] = ECanaMboxes.MBOX10.MDH.byte.BYTE5;
            CAN_BUFFER_RT[5][8] = 0;
        }
        ECanaRegs.CANRMP.bit.RMP10 = 1; /*清除所有RMP10位并开始接收消息*/
    }

    if (ECanaRegs.CANRMP.bit.RMP12 == 1) /*等待所有RMP10置位*/
    {
        /*if(Sys_Flag.bit.CAN_FLAG == 0)
         {
         CAN_BUFFER_CTRL[0] = ECanaMboxes.MBOX12.MDL.byte.BYTE4;
         CAN_BUFFER_CTRL[1] = ECanaMboxes.MBOX12.MDL.byte.BYTE3;
         CAN_BUFFER_CTRL[2] = ECanaMboxes.MBOX12.MDL.byte.BYTE2;
         CAN_BUFFER_CTRL[3] = ECanaMboxes.MBOX12.MDL.byte.BYTE1;
         CAN_BUFFER_CTRL[4] = ECanaMboxes.MBOX12.MDH.byte.BYTE8;
         CAN_BUFFER_CTRL[5] = ECanaMboxes.MBOX12.MDH.byte.BYTE7;
         CAN_BUFFER_CTRL[6] = ECanaMboxes.MBOX12.MDH.byte.BYTE6;
         CAN_BUFFER_CTRL[7] = ECanaMboxes.MBOX12.MDH.byte.BYTE5;
         Sys_Flag.bit.CAN_FLAG = 1;
         }*/
        CAN_BUFFER_CTRL_N[CAN_BUFFER_CTRL_N_index][0] = ECanaMboxes.MBOX12.MDL.byte.BYTE4;
        CAN_BUFFER_CTRL_N[CAN_BUFFER_CTRL_N_index][1] = ECanaMboxes.MBOX12.MDL.byte.BYTE3;
        CAN_BUFFER_CTRL_N[CAN_BUFFER_CTRL_N_index][2] = ECanaMboxes.MBOX12.MDL.byte.BYTE2;
        CAN_BUFFER_CTRL_N[CAN_BUFFER_CTRL_N_index][3] = ECanaMboxes.MBOX12.MDL.byte.BYTE1;
        CAN_BUFFER_CTRL_N[CAN_BUFFER_CTRL_N_index][4] = ECanaMboxes.MBOX12.MDH.byte.BYTE8;
        CAN_BUFFER_CTRL_N[CAN_BUFFER_CTRL_N_index][5] = ECanaMboxes.MBOX12.MDH.byte.BYTE7;
        CAN_BUFFER_CTRL_N[CAN_BUFFER_CTRL_N_index][6] = ECanaMboxes.MBOX12.MDH.byte.BYTE6;
        CAN_BUFFER_CTRL_N[CAN_BUFFER_CTRL_N_index][7] = ECanaMboxes.MBOX12.MDH.byte.BYTE5;
        CAN_BUFFER_CTRL_N_index++;
        if (CAN_BUFFER_CTRL_N_index > 5)
            CAN_BUFFER_CTRL_N_index = 0;

        CAN_BUFFER_CTRL_Num++;

        ECanaRegs.CANRMP.bit.RMP12 = 1; /*清除所有RMP10位并开始接收消息*/
    }

    if (ECanaRegs.CANRMP.bit.RMP14 == 1) /*等待所有RMP14置位*/
    {
        if (BORAD_NUM != 0) {
            CAN_BUFFER_RT[0][9] = ECanaMboxes.MBOX14.MDL.byte.BYTE4;
            CAN_BUFFER_RT[0][10] = ECanaMboxes.MBOX14.MDL.byte.BYTE3;
            CAN_BUFFER_RT[0][11] = ECanaMboxes.MBOX14.MDL.byte.BYTE2;
            CAN_BUFFER_RT[0][12] = ECanaMboxes.MBOX14.MDL.byte.BYTE1;
            CAN_BUFFER_RT[0][13] = ECanaMboxes.MBOX14.MDH.byte.BYTE8;
            CAN_BUFFER_RT[0][14] = ECanaMboxes.MBOX14.MDH.byte.BYTE7;
            CAN_BUFFER_RT[0][15] = ECanaMboxes.MBOX14.MDH.byte.BYTE6;
            CAN_BUFFER_RT[0][16] = ECanaMboxes.MBOX14.MDH.byte.BYTE5;
        }
        ECanaRegs.CANRMP.bit.RMP14 = 1; /*清除所有RMP14位并开始接收消息*/
    }

    if (ECanaRegs.CANRMP.bit.RMP15 == 1) /*等待所有RMP15置位*/
    {
        if (BORAD_NUM != 1) {
            CAN_BUFFER_RT[1][9] = ECanaMboxes.MBOX15.MDL.byte.BYTE4;
            CAN_BUFFER_RT[1][10] = ECanaMboxes.MBOX15.MDL.byte.BYTE3;
            CAN_BUFFER_RT[1][11] = ECanaMboxes.MBOX15.MDL.byte.BYTE2;
            CAN_BUFFER_RT[1][12] = ECanaMboxes.MBOX15.MDL.byte.BYTE1;
            CAN_BUFFER_RT[1][13] = ECanaMboxes.MBOX15.MDH.byte.BYTE8;
            CAN_BUFFER_RT[1][14] = ECanaMboxes.MBOX15.MDH.byte.BYTE7;
            CAN_BUFFER_RT[1][15] = ECanaMboxes.MBOX15.MDH.byte.BYTE6;
            CAN_BUFFER_RT[1][16] = ECanaMboxes.MBOX15.MDH.byte.BYTE5;
        }
        ECanaRegs.CANRMP.bit.RMP15 = 1; /*清除所有RMP15位并开始接收消息*/
    }

    if (ECanaRegs.CANRMP.bit.RMP16 == 1) /*等待所有RMP16置位*/
    {
        if (BORAD_NUM != 2) {
            CAN_BUFFER_RT[2][9] = ECanaMboxes.MBOX16.MDL.byte.BYTE4;
            CAN_BUFFER_RT[2][10] = ECanaMboxes.MBOX16.MDL.byte.BYTE3;
            CAN_BUFFER_RT[2][11] = ECanaMboxes.MBOX16.MDL.byte.BYTE2;
            CAN_BUFFER_RT[2][12] = ECanaMboxes.MBOX16.MDL.byte.BYTE1;
            CAN_BUFFER_RT[2][13] = ECanaMboxes.MBOX16.MDH.byte.BYTE8;
            CAN_BUFFER_RT[2][14] = ECanaMboxes.MBOX16.MDH.byte.BYTE7;
            CAN_BUFFER_RT[2][15] = ECanaMboxes.MBOX16.MDH.byte.BYTE6;
            CAN_BUFFER_RT[2][16] = ECanaMboxes.MBOX16.MDH.byte.BYTE5;
        }
        ECanaRegs.CANRMP.bit.RMP16 = 1; /*清除所有RMP16位并开始接收消息*/
    }

    if (ECanaRegs.CANRMP.bit.RMP17 == 1) /*等待所有RMP17置位*/
    {
        if (BORAD_NUM != 3) {
            CAN_BUFFER_RT[3][9] = ECanaMboxes.MBOX17.MDL.byte.BYTE4;
            CAN_BUFFER_RT[3][10] = ECanaMboxes.MBOX17.MDL.byte.BYTE3;
            CAN_BUFFER_RT[3][11] = ECanaMboxes.MBOX17.MDL.byte.BYTE2;
            CAN_BUFFER_RT[3][12] = ECanaMboxes.MBOX17.MDL.byte.BYTE1;
            CAN_BUFFER_RT[3][13] = ECanaMboxes.MBOX17.MDH.byte.BYTE8;
            CAN_BUFFER_RT[3][14] = ECanaMboxes.MBOX17.MDH.byte.BYTE7;
            CAN_BUFFER_RT[3][15] = ECanaMboxes.MBOX17.MDH.byte.BYTE6;
            CAN_BUFFER_RT[3][16] = ECanaMboxes.MBOX17.MDH.byte.BYTE5;
        }
        ECanaRegs.CANRMP.bit.RMP17 = 1; /*清除所有RMP17位并开始接收消息*/
    }

    if (ECanaRegs.CANRMP.bit.RMP18 == 1) /*等待所有RMP18置位*/
    {
        if (BORAD_NUM != 4) {
            CAN_BUFFER_RT[4][9] = ECanaMboxes.MBOX18.MDL.byte.BYTE4;
            CAN_BUFFER_RT[4][10] = ECanaMboxes.MBOX18.MDL.byte.BYTE3;
            CAN_BUFFER_RT[4][11] = ECanaMboxes.MBOX18.MDL.byte.BYTE2;
            CAN_BUFFER_RT[4][12] = ECanaMboxes.MBOX18.MDL.byte.BYTE1;
            CAN_BUFFER_RT[4][13] = ECanaMboxes.MBOX18.MDH.byte.BYTE8;
            CAN_BUFFER_RT[4][14] = ECanaMboxes.MBOX18.MDH.byte.BYTE7;
            CAN_BUFFER_RT[4][15] = ECanaMboxes.MBOX18.MDH.byte.BYTE6;
            CAN_BUFFER_RT[4][16] = ECanaMboxes.MBOX18.MDH.byte.BYTE5;
        }
        ECanaRegs.CANRMP.bit.RMP18 = 1; /*清除所有RMP18位并开始接收消息*/
    }

    if (ECanaRegs.CANRMP.bit.RMP19 == 1) /*等待所有RMP19置位*/
    {
        if (BORAD_NUM != 5) {
            CAN_BUFFER_RT[5][9] = ECanaMboxes.MBOX19.MDL.byte.BYTE4;
            CAN_BUFFER_RT[5][10] = ECanaMboxes.MBOX19.MDL.byte.BYTE3;
            CAN_BUFFER_RT[5][11] = ECanaMboxes.MBOX19.MDL.byte.BYTE2;
            CAN_BUFFER_RT[5][12] = ECanaMboxes.MBOX19.MDL.byte.BYTE1;
            CAN_BUFFER_RT[5][13] = ECanaMboxes.MBOX19.MDH.byte.BYTE8;
            CAN_BUFFER_RT[5][14] = ECanaMboxes.MBOX19.MDH.byte.BYTE7;
            CAN_BUFFER_RT[5][15] = ECanaMboxes.MBOX19.MDH.byte.BYTE6;
            CAN_BUFFER_RT[5][16] = ECanaMboxes.MBOX19.MDH.byte.BYTE5;
        }
        ECanaRegs.CANRMP.bit.RMP19 = 1; /*清除所有RMP19位并开始接收消息*/
    }

    PieCtrlRegs.PIEACK.bit.ACK9 = 1;
}

