jzrls/21C852-0/slave/src/F2812_eCAN.c
//----------------------------------------------------------------------------------------
// 发送数据打包程序
// 将需要发送的数据按照通讯规约打包成数蓁?
// 入口参数:需要发送的数据地址、发送的命令字、发送的数据长度(字)
// 出口参数:无
//----------------------------------------------------------------------------------------
void CAN_DataPackage_Tx(_iq *p_tx_data_L, Uint16 m_tx_command_L, Uint16 m_tx_length_L) {
    volatile Uint16 i;
    volatile Uint16 Data_Temp;

    *CANB.p_Tx_Buffer++ = 0x00EB;
    *CANB.p_Tx_Buffer++ = 0x0090;
    *CANB.p_Tx_Buffer++ = m_tx_command_L & 0x00FF;

    // 发送的数据字节数加上效验字节
    *CANB.p_Tx_Buffer++ = ((m_tx_length_L << 2)) >> 8;
    *CANB.p_Tx_Buffer++ = ((m_tx_length_L << 2)) & 0x00FF;

    for (i = 0; i < m_tx_length_L; i++) {
        Data_Temp = ((*p_tx_data_L) >> 24) & 0x00FF;
        *CANB.p_Tx_Buffer++ = Data_Temp;
        Data_Temp = ((*p_tx_data_L) >> 16) & 0x00FF;
        *CANB.p_Tx_Buffer++ = Data_Temp;
        Data_Temp = ((*p_tx_data_L) >> 8) & 0x00FF;
        *CANB.p_Tx_Buffer++ = Data_Temp;
        Data_Temp = (*p_tx_data_L++) & 0x00FF;
        *CANB.p_Tx_Buffer++ = Data_Temp;
    }

    Data_Temp = CalCRC16_Byte(TX_BUFFER, (m_tx_length_L << 2) + 5);
    *CANB.p_Tx_Buffer++ = (Data_Temp & 0x00FF); /* 累加求效验和*/
    *CANB.p_Tx_Buffer = (Data_Temp >> 8);       /* 累加笮а楹?*/
    CANB.p_Tx_Buffer = (Uint16 *)TX_BUFFER;
    CANB.m_Tx_Length = (m_tx_length_L << 2) + 2 + 5;
}

void CAN2_DataPackage_Tx(_iq *p_tx_data_L, Uint16 m_tx_command_L, Uint16 m_tx_length_L) {
    volatile Uint16 i;
    volatile Uint16 Data_Temp;

    *CANB2.p_Tx_Buffer++ = 0x00EB;
    *CANB2.p_Tx_Buffer++ = 0x0090;
    *CANB2.p_Tx_Buffer++ = m_tx_command_L & 0x00FF;

    // 发送的数据字节数加上效验字节
    *CANB2.p_Tx_Buffer++ = ((m_tx_length_L << 2)) >> 8;
    *CANB2.p_Tx_Buffer++ = ((m_tx_length_L << 2)) & 0x00FF;

    for (i = 0; i < m_tx_length_L; i++) {
        Data_Temp = ((*p_tx_data_L) >> 24) & 0x00FF;
        *CANB2.p_Tx_Buffer++ = Data_Temp;
        Data_Temp = ((*p_tx_data_L) >> 16) & 0x00FF;
        *CANB2.p_Tx_Buffer++ = Data_Temp;
        Data_Temp = ((*p_tx_data_L) >> 8) & 0x00FF;
        *CANB2.p_Tx_Buffer++ = Data_Temp;
        Data_Temp = (*p_tx_data_L++) & 0x00FF;
        *CANB2.p_Tx_Buffer++ = Data_Temp;
    }

    Data_Temp = CalCRC16_Byte(SCI_RX_BUFFER, (m_tx_length_L << 2) + 5);
    *CANB2.p_Tx_Buffer++ = (Data_Temp & 0x00FF); /* 累加求效验和*/
    *CANB2.p_Tx_Buffer = (Data_Temp >> 8);       /* 累加求效验和*/
    CANB2.p_Tx_Buffer = (Uint16 *)SCI_RX_BUFFER;
    CANB2.m_Tx_Length = (m_tx_length_L << 2) + 2 + 5;
}

void CAN_DataCombine_Rx(Uint16 *p_Rx) {
    volatile Uint16 i = 0, j = 0;
    for (i = 1; i < p_Rx[4]; i += 4) {
        j = (i - 1) >> 2;
        ReceData[j] = p_Rx[i + 4];
        ReceData[j] = ReceData[j] << 8;
        ReceData[j] += p_Rx[i + 5];
        ReceData[j] = ReceData[j] << 8;
        ReceData[j] += p_Rx[i + 6];
        ReceData[j] = ReceData[j] << 8;
        ReceData[j] += p_Rx[i + 7];
    }

    CANB.p_Rx_Buffer = RX_BUFFER;
}

void CAN2_DataCombine_Rx(Uint16 *p_Rx) {
    volatile Uint16 i = 0, j = 0;
    for (i = 1; i < p_Rx[4]; i += 4) {
        j = (i - 1) >> 2;
        ReceData[j] = p_Rx[i + 4];
        ReceData[j] = ReceData[j] << 8;
        ReceData[j] += p_Rx[i + 5];
        ReceData[j] = ReceData[j] << 8;
        ReceData[j] += p_Rx[i + 6];
        ReceData[j] = ReceData[j] << 8;
        ReceData[j] += p_Rx[i + 7];
    }

    CANB2.p_Rx_Buffer = SCI_TX_BUFFER;
}

void Can_Deal(void) {
    volatile Uint16 command, i = 0;
    command = (RX_BUFFER[2]);

    switch (command) {
    case 0x0000: // 初始化检测控制器指令			lxy
        SendData[0] = ReceData[1];
        SendData[1] = BORAD_NUM;
        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0070, 2);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x0001:                             // 清除故障标志指令			lxy
        Sys_Flag.bit.STOP_PWM_Flag_Id = 0;   // "1"表明电机过流保护
        Sys_Flag.bit.STOP_PWM_Flag_Velo = 0; // "1"表明超速保护
        Sys_Flag.bit.UDC_FLAG = 0;           // "1"表明直流电压故障
        Sys_Flag.bit.STOP_PWM_Flag_Driv = 0;

        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0071, 0);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x000D: // LOCK
        CAN_DataCombine_Rx(RX_BUFFER);
        Usa_Lock = ReceData[0];
        Usb_Lock = ReceData[1];
        Usc_Lock = ReceData[2];
        Udc_Lock = ReceData[3];
        Choose_Mche = ReceData[4];
        Ctrl_Flag.bit.LOCK_FLAG = 1;
        Ctrl_Flag.bit.OPEN_LOOP_FLAG = 0;
        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x007D, 0);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x0002: // Read Position
        SendData[0] = Isa;
        SendData[1] = Isb;
        SendData[2] = Isc;
        SendData[3] = rdc1.DATA_BUFFER;
        SendData[4] = Idc;
        // SendData[5] = IsbB;
        // SendData[6] = IscB;
        SendData[7] = rdc2.DATA_BUFFER;

        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0072, 8);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x0003: // Openloop

        CAN_DataCombine_Rx(RX_BUFFER);
        Um_OpenLoop = ReceData[0];
        Freq_OpenLoop = ReceData[1];
        Udc_OpenLoop = ReceData[2];
        Choose_Mche = ReceData[3];
        Ctrl_Flag.bit.OPEN_LOOP_FLAG = 1;
        Ctrl_Flag.bit.LOCK_FLAG = 0;
        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0073, 0);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x000E: // Release LOCK

        CAN_DataCombine_Rx(RX_BUFFER);
        Choose_Mche = ReceData[0];
        Ctrl_Flag.bit.LOCK_FLAG = 0;
        Ctrl_Flag.bit.OPEN_LOOP_FLAG = 0;
        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x007E, 0);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x0004: // 写电机参数和基值系统指令			lxy
        CAN_DataCombine_Rx(RX_BUFFER);
        getMotorParams(ReceData);

        Velo_PerAdd = _IQmpy(Velo_Add, Per_Ctrl);
        Velo_Duty = _IQdiv(3750000, Control_Period);

        p = _IQdiv(Mp, Rp); /* 电机与旋变的极对数比 */
        Udc_Mche_realvalue = _IQdiv(_IQ(1), Udc_Setg);
        K_Velo_Cal = _IQdiv(_IQ(62.83185307179586476925286766559), V_Base);
        K_Velo_Cal = _IQmpy(K_Velo_Cal, Velo_Duty0); // 定时器周期为100us
        K_Velo_Cal = _IQdiv(K_Velo_Cal, Velo_Calc_Num << 20);
        K_Velo_Cal = _IQmpy(K_Velo_Cal, p);
        Is_PerAdd = _IQmpy(Is_Add, Per_Ctrl);
        Is_DownPerAdd = _IQmpy(Is_DownAdd, Per_Ctrl);
        pi_Id_Kc.Kp_reg = _IQmpy(Idq_Kc, Ld);
        pi_Id_Kc.Ki_reg = _IQmpy(V_Base, Per_Ctrl);
        pi_Id_Kc.Ki_reg = _IQmpy(pi_Id_Kc.Ki_reg, (pi_Id_Kc.i_period << 20));
        pi_Id_Kc.Ki_reg = _IQmpy(Idq_Kc, pi_Id_Kc.Ki_reg);
        pi_Iq_Kc.Kp_reg = _IQmpy(Idq_Kc, Lq);
        pi_Iq_Kc.Ki_reg = pi_Id_Kc.Ki_reg;

        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0074, 0);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }

        break;
    case 0x0005: // 读电机参数和基值系统指令		lxy
        SendData[0] = Rs;
        SendData[1] = Ld;
        SendData[2] = Lq;
        SendData[3] = PHI;
        SendData[4] = Mp;
        SendData[5] = Rp;
        SendData[6] = Udc_Setg;
        SendData[7] = U_Base;
        SendData[8] = I_Base;
        SendData[9] = V_Base; // 电械速度基值(rad/s)
        SendData[10] = Angle_Init_Digital;
        SendData[11] = Velo_Max;
        SendData[12] = id_Max;
        SendData[13] = Is_Add;
        SendData[14] = Control_Period;
        SendData[15] = id_Filter;
        SendData[16] = Udc_Filter;
        SendData[17] = Velo_Filter;
        SendData[18] = Deadtime;
        SendData[19] = Velo_Add;
        SendData[20] = Is_DownAdd;
        SendData[21] = Temp_Filter;
        SendData[22] = Angle_Init_Fa;
        SendData[23] = Com_angle_U;
        SendData[24] = Com_angle_I;
        SendData[25] = idSet_Max;
        // SendData[26] = Freq_cut;
        SendData[27] = IsLimit_Set;
        SendData[28] = MotorTM;
        SendData[29] = igbtTemperatureProtectionValue;

        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0075, 30);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x0006: // 位置控制指令			lxy

        if (Sys_Flag.bit.STOP_PWM_Flag_Driv == 1) {
            SendData[0] = 1;
        } else if ((Ctrl_Flag.bit.FIRST_PWM_Flag == 1 && Velo_Elec_abs > Velo_Start)) {
            SendData[0] = 2;
        } else {
            CAN_DataCombine_Rx(RX_BUFFER);
            Isd_Set = ReceData[0];
            Pos_Set = ReceData[1];
            if (Pos_Set > POSMAX)
                Pos_Set = POSMAX;
            if (Pos_Set < POSMIN)
                Pos_Set = POSMIN;
            TorqueAngleA = ReceData[2];
            Ctrl_Flag.bit.VELO_CONTROL_FLAG = 1;
            Ctrl_Flag.bit.STOP_VELO_FLAG = 0;
            Ctrl_Flag.bit.POS_CONTROL_FLAG = 1;
            Ctrl_Flag.bit.TORQ_CONTROL_FLAG = 1;
            SendData[0] = 0;
        }

        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0076, 1);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }

        break;
    case 0x0007: // 速度控制指令			lxy

        if (Sys_Flag.bit.STOP_PWM_Flag_Driv == 1) {
            SendData[0] = 1;
        } else if ((Ctrl_Flag.bit.FIRST_PWM_Flag == 1 && Velo_Elec_abs > Velo_Start)) {
            SendData[0] = 2;
        } else {
            CAN_DataCombine_Rx(RX_BUFFER);
            Isd_Set = ReceData[0];
            Veloover_Set = ReceData[1];
            if (Veloover_Set > maxSpeed) {
                Veloover_Set = maxSpeed;
            }
            if (Veloover_Set < -maxSpeed) {
                Veloover_Set = -maxSpeed;
            }
            TorqueAngleA = ReceData[2];
            Ctrl_Flag.bit.VELO_CONTROL_FLAG = 1;
            Ctrl_Flag.bit.STOP_VELO_FLAG = 0;
            Ctrl_Flag.bit.POS_CONTROL_FLAG = 0;
            Ctrl_Flag.bit.TORQ_CONTROL_FLAG = 1;
            SendData[0] = 0;
        }

        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0077, 1);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }

        break;
    case 0x0008: // 转矩控制指令			lxy
        CAN_DataCombine_Rx(RX_BUFFER);
        Choose_Mche = ReceData[0];
        Choose_Mode = ReceData[1];
        SendData[0] = 0;
        SendData[1] = 0;
        if (Sys_Flag.bit.STOP_PWM_Flag_Driv == 1) {
            SendData[0] = 1;
        } else if ((Ctrl_Flag.bit.FIRST_PWM_Flag == 1 && Velo_Elec_abs > Velo_Start)) {
            SendData[0] = 2;
        } else {
            if (Choose_Mode == 0) {
                Isd_Set = ReceData[2];
                Isdq_Set1 = -ReceData[3];
                TorqueAngleA = ReceData[4];
                Ctrl_Flag.bit.TORQ_CONTROL_FLAG = 1; // 置转矩控制标志
                Ctrl_Flag.bit.VELO_CONTROL_FLAG = 0;
                Ctrl_Flag.bit.POS_CONTROL_FLAG = 0;
                Ctrl_Flag.bit.STOP_VELO_FLAG = 0;
            } else if (Choose_Mode == 1) {
                Isd_Set = ReceData[2];
                Veloover_Set = ReceData[3];
                if (Veloover_Set > maxSpeed)
                    Veloover_Set = maxSpeed;
                if (Veloover_Set < -maxSpeed)
                    Veloover_Set = -maxSpeed;
                TorqueAngleA = ReceData[4];
                Ctrl_Flag.bit.VELO_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.POS_CONTROL_FLAG = 0;
                Ctrl_Flag.bit.STOP_VELO_FLAG = 0;
                Ctrl_Flag.bit.TORQ_CONTROL_FLAG = 1;
            } else {
                Isd_Set = ReceData[2];
                Pos_Set = ReceData[3];
                if (Pos_Set > POSMAX)
                    Pos_Set = POSMAX;
                if (Pos_Set < POSMIN)
                    Pos_Set = POSMIN;
                TorqueAngleA = ReceData[4];
                Ctrl_Flag.bit.VELO_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.POS_CONTROL_FLAG = 1;
                Ctrl_Flag.bit.STOP_VELO_FLAG = 0;
                Ctrl_Flag.bit.TORQ_CONTROL_FLAG = 1;
            }
            SendData[0] = 0;
        }
        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0078, 2);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x0009: // 读入电机传感器指令			lxy
        CAN_DataCombine_Rx(RX_BUFFER);
        Choose_Mche = ReceData[0];
        Sys_Flag.bit.RDC_FAULT = rdc1.FAULT;
        SendData[0] = Velo_Elec;
        SendData[1] = Udc_Mche_1;
        SendData[2] = Id;
        SendData[3] = Iq;
        SendData[4] = Sys_Flag.all;
        SendData[5] = IdZ_Set;
        SendData[6] = IqZ_Set;
        SendData[7] = Us;
        SendData[8] = pi_Id_Kc.ui_reg;
        SendData[9] = pi_Iq_Kc.ui_reg;
        SendData[10] = Ud;
        SendData[11] = Uq;
        SendData[12] = Time_Cal;
        SendData[13] = Temperature1;
        SendData[14] = Veloover_Set;
        SendData[15] = Temperature3;
        SendData[17] = Ctrl_Flag.all;
        SendData[18] = Temperature5;
        SendData[19] = Idc;
        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0079, 22);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x000A: // 电机停转指令			lxy
        CAN_DataCombine_Rx(RX_BUFFER);
        Choose_Mche = ReceData[0];
        Ctrl_Flag.bit.STOP_VELO_FLAG = 1;

        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x007A, 0);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x000B: // 写控制参数指令
        CAN_DataCombine_Rx(RX_BUFFER);
        getControlParams(ReceData);

        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x007B, 0);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x000C: // 读参数指令
        setControlParams(SendData);
        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x007C, 30);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x0010: // 写模拟指令
        CAN_DataCombine_Rx(RX_BUFFER);
        getAnalogParams(ReceData);
        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0080, 0);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x0011: // 读参数指令
        SendData[0] = K_Udc;
        SendData[1] = Off_Udc;
        SendData[2] = K_Isa;
        SendData[3] = Off_Isa;
        SendData[4] = K_Isc;
        SendData[5] = Off_Isc;
        SendData[8] = K_Idc;
        SendData[9] = Off_Idc;
        SendData[12] = PWMA_a;
        SendData[13] = PWMA_b;
        SendData[14] = PWMA_c;
        SendData[22] = Us_M;
        SendData[23] = K_Isb;
        SendData[24] = Off_Isb;

        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0081, 27);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x0012: // 写其他参数指令
        CAN_DataCombine_Rx(RX_BUFFER);
        getOtherParams(ReceData);
        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0082, 0);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x0013: // 读其他参数指令
        SendData[0] = Temperature1_K;
        SendData[1] = UdcLimit1_Set;
        // SendData[2] = TemperatureB1_K;
        // SendData[3] = Harm_LdivR;
        SendData[4] = ProtectNum;
        SendData[5] = UsSet;
        // SendData[6] = Ctrl_Flag.bit.CanCtrl_Flag;
        SendData[7] = TorqueAngle;
        // SendData[8] = TemperatureB5_K;
        // SendData[9] = TemperatureB5_Off;
        SendData[10] = Temperature3_K;
        // SendData[11] = TemperatureB3_K;
        SendData[12] = Ctrl_Flag.bit.RotorWay_Flag;
        // SendData[13] = Sys_Flag.bit.RotorWay_Flag;
        SendData[14] = UdcLimit_Set;
        SendData[15] = Velo_Start; // 启动速度
        SendData[16] = maxSpeed;
        SendData[17] = Ctrl_Flag.bit.VelWay_Flag;
        SendData[18] = TorquetoIs; // 转矩电流比
        SendData[19] = IdProtectNum;
        SendData[20] = VeloProtectNum;
        SendData[21] = Velo_Calc_Num;
        SendData[22] = Temperature1_Off;
        // SendData[23] = TemperatureB1_Off;
        SendData[24] = Temperature3_Off;
        // SendData[25] = TemperatureB3_Off;
        // SendData[26] = CtrlB_Flag.bit.VelWay_Flag;
        SendData[27] = Ctrl_Flag.bit.UsCtrl_Flag;
        SendData[28] = Temperature5_K;
        SendData[29] = Temperature5_Off;

        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x0083, 30);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }
        break;
    case 0x0060: // 写入EEPROM指令

        WriteEEProm_Flag = 1;

        if (CANB.FLAG.bit.TXBO_FLAG == 1) {
            CAN_DataPackage_Tx(SendData, 0x00D0, 0);
            CANB.FLAG.bit.TXBO_FLAG = 0;
        }

        break;

    default:
        break;
    }
    while (CANB.FLAG.bit.TXBO_FLAG == 0) {
        Can_Tx_Data();
    }
}

void Can_Receive(void) {
    if (SCIB.FLAG.bit.TXBO_FLAG == 1) {
        SCIB.p_Tx_Buffer = SCI_TX_BUFFER;
        SCIB.m_Tx_Length = SCI_TX_BUFFER[4] + 7;
        SCIB.FLAG.bit.TXBO_FLAG = 0;
    }
}

void Can_Send(void) {
    volatile Uint16 command;
    command = (SCI_RX_BUFFER[2]);

    if (command == 0) {
        SendData[0] = Board_Num;
        SendData[1] = BORAD_NUM;
        if (CANB2.FLAG.bit.TXBO_FLAG == 1) {
            CAN2_DataPackage_Tx(SendData, 0x0000, 2);
        }
    } else {
        CANB2.p_Tx_Buffer = (Uint16 *)SCI_RX_BUFFER;
        CANB2.m_Tx_Length = SCI_RX_BUFFER[4] + 7;
    }
    CANB2.FLAG.bit.TXBO_FLAG = 0;

    while (CANB2.FLAG.bit.TXBO_FLAG == 0) {
        Can_Tx2_Data();
    }
}
